brew "bat"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "httpie"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "mise"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tldr"
brew "zoxide"
cask "1password"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "raycast"
cask "rectangle"
cask "shottr"
cask "visual-studio-code"
mas "1Password for Safari", id: 1569813296
vscode "bradlc.vscode-tailwindcss"
vscode "jakebecker.elixir-ls"
vscode "phoenixframework.phoenix"
vscode "usernamehw.errorlens"
