# --- Core Infrastructure ---
brew "git"
brew "stow"
brew "mas"       # Mac App Store CLI
brew "gh"        # GitHub CLI
brew "flyctl"    # Fly.io CLI

# --- CLI QoL ---
brew "lazydocker"
brew "lazygit"
brew "git-delta"  # Better git diffs
brew "direnv"     # Per-project env vars
brew "tree"       # Directory visualization
brew "dust"       # Better du (disk usage)
brew "btop"       # System monitor
brew "trash"      # Safe rm (moves to trash)
brew "yq"         # jq for YAML
brew "ffmpeg"     # AI can compressed videos, etc.
brew "figlet"     # For ASCII art

# --- Shell & Terminal ---
brew "fastfetch"
brew "fish"
brew "starship"  # Prompt
brew "zoxide"    # Smarter cd
brew "bat"       # Better cat
brew "eza"       # Better ls
brew "fzf"       # Fuzzy finder
brew "ripgrep"   # Fast search (rg)
brew "fd"        # Fast find
brew "jq"        # JSON processor
brew "tldr"      # Simplified man pages
brew "httpie"    # HTTP client

# --- Runtimes (Version Management) ---
brew "mise"      # Manages Node, Elixir, Java

# --- GUI Apps (Casks) ---
cask "ghostty"
cask "1password"
cask "discord"

# Editor
cask "zed"              # Rust-based Editor
cask "visual-studio-code"
cask "intellij-idea"

# Utilities
cask "rectangle"        # Window management
cask "shottr"           # Screenshots
#cask "raycast"

# Infrastructure
cask "orbstack"          # The lightweight Docker replacement
cask "tableplus"         # Native, fast DB client
cask "bruno"             # API Client that lives in your Git repo
#cask "docker-desktop"

# Browsers
cask "arc"
cask "brave-browser"

# Knowledge & AI
cask "obsidian"
cask "claude"
brew "ollama"

# Productivity (Microsoft 365)
cask "microsoft-office" # Installs Word, Excel, PowerPoint, Outlook, OneNote
cask "microsoft-teams"

# --- Fonts ---
cask "font-monaspace"   # Texture Healing (Neon, Argon, etc.)
cask "font-jetbrains-mono-nerd-font" # Backup/Icons

# --- Mac App Store (Optional) ---
mas "Xcode", id: 497799835
mas "1Password for Safari", id: 1569813296
mas "Pages", id: 409201541
mas "Keynote", id: 409183694

# --- VS Code (Extensions) ---
vscode "bradlc.vscode-tailwindcss"
vscode "jakebecker.elixir-ls"
vscode "phoenixframework.phoenix"
vscode "usernamehw.errorlens"
vscode "golang.go"
