# --- Core Infrastructure ---
brew "git"
brew "stow"
brew "mas"       # Mac App Store CLI
brew "gh"        # GitHub CLI
brew "flyctl"    # Fly.io CLI

# --- CLI QoL ---
brew "lazydocker"
brew "lazygit"

# --- Shell & Terminal ---
brew "fastfetch"
brew "fish"
brew "starship"  # Prompt
brew "zoxide"    # Smarter cd
brew "bat"       # Better cat
brew "eza"       # Better ls
brew "fzf"       # Fuzzy finder
brew "ripgrep"   # Fast search (rg)
brew "fd"        # Fast find
brew "jq"        # JSON processor
brew "tldr"      # Simplified man pages
brew "httpie"    # HTTP client

# --- Runtimes (Version Management) ---
brew "mise"      # Manages Node, Elixir, Java

# --- GUI Apps (Casks) ---
cask "ghostty"
cask "zed"              # Rust-based Editor
cask "visual-studio-code"
cask "docker-desktop"
cask "1password"
cask "discord"
#cask "raycast"
cask "rectangle"        # Window management
cask "shottr"           # Screenshots

# Browsers
cask "arc"
cask "brave-browser"

# Knowledge & AI
cask "obsidian"
cask "claude"

# Productivity (Microsoft 365)
cask "microsoft-office" # Installs Word, Excel, PowerPoint, Outlook, OneNote
cask "microsoft-teams"

# --- Fonts ---
cask "font-monaspace"   # Texture Healing (Neon, Argon, etc.)
cask "font-jetbrains-mono-nerd-font" # Backup/Icons

# --- Mac App Store (Optional) ---
mas "Xcode", id: 497799835
mas "1Password for Safari", id: 1569813296

# --- VS Code (Extensions) ---
vscode "bradlc.vscode-tailwindcss"
vscode "jakebecker.elixir-ls"
vscode "phoenixframework.phoenix"
vscode "usernamehw.errorlens"
